CSI API ETABS v1
cDatabaseTables.GetTableForEditingCSVString Method
 Returns a single table in a CSV-formatted string for interactive editing.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetTableForEditingCSVString(
	string TableKey,
	string GroupName,
	ref int TableVersion,
	ref string csvString,
	string sepChar = ","
)
Function GetTableForEditingCSVString (
	TableKey As String,
	GroupName As String,
	ByRef TableVersion As Integer,
	ByRef csvString As String,
	Optional sepChar As String = ","
) As Integer
Dim instance As cDatabaseTables
Dim TableKey As String
Dim GroupName As String
Dim TableVersion As Integer
Dim csvString As String
Dim sepChar As String
Dim returnValue As Integer
returnValue = instance.GetTableForEditingCSVString(TableKey,
	GroupName, TableVersion, csvString,
	sepChar)
int GetTableForEditingCSVString(
	String^ TableKey,
	String^ GroupName,
	int% TableVersion,
	String^% csvString,
	String^ sepChar = L","
)
abstract GetTableForEditingCSVString :
        TableKey : string *
        GroupName : string *
        TableVersion : int byref *
        csvString : string byref *
        ?sepChar : string
(* Defaults:
        let _sepChar = defaultArg sepChar ","
*)
-> int
Parameters
TableKey
Type: System.String
Input Item: The table key for a table which will be interactively edited. The table must be one that can be interactively edited.
GroupName
Type: System.String
 Input Item: IMPORTANT NOTE: This parameter is not active in this release.
 The name of a group for which data will be returned.
TableVersion
Type: System.Int32
Returned Item: The version number of the specified table.
csvString
Type: System.String
Returned Item: A CSV-formatted string containing all the table data.
sepChar (Optional)
Type: System.String
Optional Input Item: The delimiter between data items, by default ","
Return Value
Type: Int32
Returns 0 if the function executes correctly, otherwise returns nonzero
See Also
Reference
cDatabaseTables Interface
ETABSv1 Namespace